Namespace(D2=4, K=3, batch_size=256, decay_rate=0.01, frac_train=0.9, learning_rate=0.0001, n_epochs=5, nbins=200, num_test=20000, num_train=200000, prtb=False, resampleTrain=False, rm_band=False, select_per_bin=400, sim='des', sim2='irac', use_lindseys_test=True)
using lindsey's test
Training on sim:  des
X training data shape:  (2000000, 5)
y training data shape:  (2000000,)
Training on sim:  irac
X training data shape:  (2000000, 4)
y training data shape:  (2000000,)
[-0.19  -0.151 -0.137 12.315 -0.51  11.386] [ 2.422  1.593  1.163 32.503  0.177 32.137]
=== After trimming ==
Size of features in test data: (221193, 6)
Size of output in test data: (221193,)
Size of features in training data: (1800000, 6)
Size of output in training data: (1800000,)
Size of features in test data: (221193, 6)
Size of output in test data: (221193,)
----------
number of datapoints:  1800000
z-minmax:  0.0 1.0
ColMag-min:  [-1.473 -1.562 -1.655 -4.154 -2.237 -3.436]
ColMag-max:  [5.063 4.53  3.596 2.433 1.667 2.649]
----------
----------
number of datapoints:  221193
z-minmax:  -0.005134179175198079 1.0089317433343508
ColMag-min:  [-1.473 -1.562 -1.655 -2.88  -2.237 -2.337]
ColMag-max:  [5.063 4.53  3.596 1.46  1.667 1.552]
----------
Model: "mdn"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 6)]          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          3584        input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         525312      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         2099200     dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          524800      dense_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          131328      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           8256        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           2080        dense_7[0][0]                    
__________________________________________________________________________________________________
sigma (Dense)                   (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
mu (Dense)                      (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 3)            0           sigma[0][0]                      
__________________________________________________________________________________________________
mixing (Dense)                  (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.compat.v1.transpose (TFOpLam (1, None)            0           input_1[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (1, None)            0           tf.compat.v1.transpose[0][0]     
__________________________________________________________________________________________________
tf.compat.v1.shape_1 (TFOpLambd (2,)                 0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.__operators__.getitem_1 (Sli (2,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_2 (Sli (0,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.concat (TFOpLambda)          (3,)                 0           tf.__operators__.getitem_1[0][0] 
                                                                 tf.__operators__.getitem_2[0][0] 
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (1, None, 1)         0           tf.convert_to_tensor_3[0][0]     
                                                                 tf.concat[0][0]                  
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 3)            0           mu[0][0]                         
__________________________________________________________________________________________________
tf.convert_to_tensor_4 (TFOpLam (1, None, 1)         0           tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.identity (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 3)            0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (1, None, 3)         0           tf.convert_to_tensor_4[0][0]     
                                                                 tf.identity[0][0]                
__________________________________________________________________________________________________
tf.identity_1 (TFOpLambda)      (None, 3)            0           tf.convert_to_tensor_2[0][0]     
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (1, None, 3)         0           tf.math.subtract[0][0]           
                                                                 tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (1, None, 3)         0           tf.math.truediv[0][0]            
__________________________________________________________________________________________________
tf.math.log_1 (TFOpLambda)      (None, 3)            0           tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 3)            0           mixing[0][0]                     
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (1, None, 3)         0           tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 3)            0           tf.math.log_1[0][0]              
__________________________________________________________________________________________________
tf.math.log (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (1, None, 3)         0           tf.math.multiply[0][0]           
                                                                 tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
tf.nn.log_softmax (TFOpLambda)  (None, 3)            0           tf.math.log[0][0]                
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (1, None, 3)         0           tf.math.subtract_1[0][0]         
                                                                 tf.nn.log_softmax[0][0]          
__________________________________________________________________________________________________
tf.math.reduce_logsumexp (TFOpL (1, None)            0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
tf.math.multiply_1 (TFOpLambda) (1, None)            0           tf.math.reduce_logsumexp[0][0]   
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda ()                   0           tf.math.multiply_1[0][0]         
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.reduce_mean[0][0]        
==================================================================================================
Total params: 5,425,929
Trainable params: 5,425,929
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/5
   1/6329 [..............................] - ETA: 2:39:35 - loss: 1.6584   2/6329 [..............................] - ETA: 9:31 - loss: 1.6565      3/6329 [..............................] - ETA: 14:15 - loss: 1.6544   6/6329 [..............................] - ETA: 7:14 - loss: 1.6487    9/6329 [..............................] - ETA: 5:27 - loss: 1.6431  12/6329 [..............................] - ETA: 4:34 - loss: 1.6362  15/6329 [..............................] - ETA: 4:07 - loss: 1.6268  18/6329 [..............................] - ETA: 3:47 - loss: 1.6145  21/6329 [..............................] - ETA: 3:33 - loss: 1.5987  24/6329 [..............................] - ETA: 3:24 - loss: 1.5805  27/6329 [..............................] - ETA: 3:16 - loss: 1.5613  30/6329 [..............................] - ETA: 3:10 - loss: 1.5416  33/6329 [..............................] - ETA: 3:05 - loss: 1.5223  36/6329 [..............................] - ETA: 3:00 - loss: 1.5037  39/6329 [..............................] - ETA: 2:57 - loss: 1.4858  42/6329 [..............................] - ETA: 2:53 - loss: 1.4688  45/6329 [..............................] - ETA: 2:51 - loss: 1.4528  48/6329 [..............................] - ETA: 2:49 - loss: 1.4377  51/6329 [..............................] - ETA: 2:46 - loss: 1.4235  54/6329 [..............................] - ETA: 2:44 - loss: 1.4100  57/6329 [..............................] - ETA: 2:43 - loss: 1.3972  60/6329 [..............................] - ETA: 2:41 - loss: 1.3851  63/6329 [..............................] - ETA: 2:39 - loss: 1.3737  66/6329 [..............................] - ETA: 2:38 - loss: 1.3629  69/6329 [..............................] - ETA: 2:37 - loss: 1.3527  72/6329 [..............................] - ETA: 2:36 - loss: 1.3430  75/6329 [..............................] - ETA: 2:35 - loss: 1.3337